package com.example.a20240923mytrainingsession

class ExerciseBase {
    companion object {
        val exercises = mutableListOf(
            Exercise(
                "Эллиптический тренажёр",
                "Совершайте эллиптические движения ногами и двигайте вертикальные рычаги.",
                30,
                R.drawable.t01,
                "выносливость"
            ),
            Exercise(
                "Велотренажёр",
                "Крутите педали.",
                30,
                R.drawable.t02,
                "выносливость"
            ),
            Exercise(
                "Гребной тренажёр",
                "Крутите педали.",
                30,
                R.drawable.t02,
                "выносливость"
            ),
            Exercise(
                "Плавание",
                "Выполняйне плавание в бассейне или на открытой воде любым спортивным стилем не менее получаса. Контролируйте корректность техники стиля плавания. Чередуйте стили плавания во время тренировки. ",
                30,
                R.drawable.t02,
                "выносливость"
            ),
            Exercise(
                "Отжимания от пола",
                "Исходное положение - планка, руки на ширине плеч. Сгибание рук проиводится до касания грудью пола с фиксацие в нижней точке, локти параллельно телу. Поднятие корпуса должно производиться до полного разгибания рук с фиксацией в верхней точке.",
                30,
                R.drawable.how_to_push_up,
                "сила"
            ),
            Exercise(
                "Подтягивания на перекладине",
                "",
                30,
                R.drawable.t04,
                "сила"
            ),
            Exercise(
                "",
                "",
                30,
                R.drawable.t05,
                "сила"
            ),
            Exercise(
                "",
                "",
                30,
                R.drawable.t06,
                "сила"
            ),
            Exercise(
                "",
                "",
                30,
                R.drawable.t07,
                "быстрота"
            ),
            Exercise(
                "Челночный бег",
                "Разместите два конуса на расстоянии около метра друг от друга. Бегите от первого конуса ко второму и сразу же обратно. Повторите от шести до восьми раз. Измените упражнение, двигаясь боком и высоко поднимая колени.",
                30,
                R.drawable.t08,
                "ловкость"
            ),
            Exercise(
                "Прыжки со сменой ног",
                "Встаньте на правую ногу и прыгните на ней вбок, приземлившись на эту же ногу. С правой ноги прыгайте на левую. Через некоторое время попытайтесь попрыгать в обе стороны только на левой, а потом только на правой ноге.",
                30,
                R.drawable.t08,
                "ловкость"
            ),
            Exercise(
                "Прыжки со сменой стойки",
                "Сядьте на корточки, переведите центр тяжести вперед и прыгните, выпрямив ноги и выставив руки перед собой. Вы должны приземлиться в положении планки, после чего согнуть руки и оттолкнуться от пола, чтобы снова встать на корточки.",
                30,
                R.drawable.t08,
                "ловкость"
            ),
            Exercise(
                "Прыжки с махами руками",
                "Начните прыгать на месте, чередуя стойки с ногами по швам и стойкой с ногами на ширине плеч. Затем на каждый прыжок начните делать поднятия рук, чередуя выпрямления рук впереди себя и по бокам.",
                30,
                R.drawable.t08,
                "ловкость"
            ),
        )
    }
}